---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.CreateIFCAnyHandle(Autodesk.Revit.DB.IFC.IFCAnyHandle)
source: html/9e793dae-49f0-7b51-c781-534c1d25ee92.htm
---
# Autodesk.Revit.DB.IFC.IFCData.CreateIFCAnyHandle Method

Creates an IFCAnyHandle data object.

## Syntax (C#)
```csharp
public static IFCData CreateIFCAnyHandle(
	IFCAnyHandle value
)
```

## Parameters
- **value** (`Autodesk.Revit.DB.IFC.IFCAnyHandle`) - The IFCAnyHandle value.

## Returns
The IFCData object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null